.config/yadm/ondemand/build-emacs/build-emacs.org
:DOC-CONFIG:
#+property: header-args :mkdirp yes :comments both
#+startup: fold
#+title: Build emacs
#+author: Venky Iyer
#+email: indigoviolet@gmail.com
:END:



* Prerequisites:

- sudo apt-get install autoconf automake libtool texinfo build-essential xorg-dev libgtk2.0-dev libjpeg-dev libncurses5-dev libdbus-1-dev libgif-dev libtiff-dev libm17n-dev libpng-dev librsvg2-dev libotf-dev libgnutls28-dev libxml2-dev libjansson-dev libwebkit2gtk-4.0-dev libgccjit0 libgccjit-10-dev
- sudo apt-get build-dep emacs


* Checkout emacs

First clean ~/dev/emacs

- (prefer github) git clone --depth 1 git://git.sv.gnu.org/emacs.git ~/dev/emacs
- (for master) git clone --shallow-since="28 days ago" git@github.com:emacs-mirror/emacs.git --branch master ~/dev/emacs
- (for native-comp) git clone --shallow-since="28 days ago" git@github.com:emacs-mirror/emacs.git --branch feature/native-comp ~/dev/emacs

* build-emacs-master.sh

#+BEGIN_SRC shell :tangle build-emacs-master.sh##c.personal,e.sh :shebang "#!/bin/zsh"
# build-emacs-master.sh --- fetch, review, merge and build Emacs.

set -ev

cd ~/dev/emacs

## branch enforcing: turned off for native-comp
# git branch | grep '^\* master' >/dev/null || exit 'Not on branch master!'

git fetch

## News/Diff: not useful
# echo News since HEAD:
# git diff HEAD..FETCH_HEAD -- etc/NEWS
# echo
# echo Commits since HEAD:
# git log --graph --oneline HEAD..FETCH_HEAD
# echo 'Continue with build (RETURN to continue, ^C to quit)?'
# read nought

# BRANCH='master'
BRANCH='emacs-29'

## on nativecomp: Pinned commit for https://discord.com/channels/406534637242810369/406536226166800384/797785171767197716
# PINNED='213b5d73159cafbdd52b9c0fb0479544cca98a77'
PINNED='HEAD'
# PINNED='c5af19'

echo "Using pinned commit $PINNED on $BRANCH (RETURN to continue, ^C to quit)"
read nought

git checkout $BRANCH && git pull --ff && git clean -dfx && make clean
git checkout $PINNED

sudo apt-get install --no-install-recommends -y \
    libjansson4 libjansson-dev \
    libgccjit0 libgccjit-11-dev\
    gcc-11 \
    libwebp-dev \
    libtree-sitter0 libtree-sitter-dev

# .zshcustom/build.zsh
# 7:export PKG_CONFIG_PATH=/usr/lib/x86_64-linux-gnu/pkgconfig:/usr/share/pkgconfig
CC= ~/.config/yadm/ondemand/build-emacs/configure-emacs.sh

make -j8

echo Build finished, hit RETURN to continue to testing w/ -Q.
read nought
./src/emacs -Q

echo Hit RETURN to test w/ configuration.
read nought
./src/emacs

echo Hit RETURN to install...
read nought
sudo make -j8 install

installed_commit=$(git rev-parse --short HEAD)
echo "Installed: $installed_commit" | ts >> build-emacs.log

systemctl --user disable emacs.service
sudo rm /usr/local/share/applications/{emacsclient,emacs-mail,emacsclient-mail}.desktop

echo Rebuilding doom
doom sync
#+END_SRC

* configure-emacs.sh

#+BEGIN_SRC shell :tangle configure-emacs.sh##c.personal,e.sh :shebang "#!/bin/sh"
set -ev

PREFIX=/usr/local

if [ ! -f configure ]; then
    ./autogen.sh all
fi

echo version: $V

# --with-xwidgets needed for katex-render (which requires --with-x-toolkit=gtk3)
# --with-pgtk only for Wayland\
./configure \
    --prefix=$PREFIX \
    --with-native-compilation \
    --with-json \
    --with-tree-sitter \
    --with-xwidgets \
    --with-modules \
    --program-transform-name=s/^ctags$/ctags_emacs/ \
    --with-file-notification=yes \
    --with-x-toolkit=gtk3 \
    --without-compress-install\
    --with-gameuser=no \
    --with-cairo \
    CFLAGS="-O2 -pipe -march=native -fomit-frame-pointer"
#+END_SRC
